Тема “Работа с данными в Pandas”

TASK 1

In [155]:
import numpy as np
import pandas as pd

In [156]:
authors = pd.DataFrame({'author_id':[1, 2, 3],'author_name':['Тургенев', 'Чехов', 'Островский']})
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [157]:
books = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3],'book_title':
                     ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 
                      'Таланты и поклонники'], 'price':[450, 300, 350, 500, 450, 370, 290]})
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

TASK 2

In [158]:
authors_price = pd.merge(authors, books, on= 'author_id', how='inner' )
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

TASK 3

In [159]:
top5 = authors_price.sort_values('price').tail(5)
top5

   author_id author_name         book_title  price
2          1    Тургенев  Дворянское гнездо    350
5          3  Островский              Гроза    370
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
3          2       Чехов   Толстый и тонкий    500

In [160]:
top = authors_price.nlargest(5, 'price')
top

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

TASK 4

In [161]:
max_price = authors_price.groupby("author_name")['price'].max()
max_price

author_name
Островский    370
Тургенев      450
Чехов         500
Name: price, dtype: int64

In [162]:
min_price = authors_price.groupby("author_name")['price'].min()
min_price

author_name
Островский    290
Тургенев      300
Чехов         450
Name: price, dtype: int64

In [163]:
mean_price = authors_price.groupby("author_name")['price'].mean()

In [164]:
mean_price

author_name
Островский    330.000000
Тургенев      366.666667
Чехов         475.000000
Name: price, dtype: float64

In [165]:
authors_stat_1 = pd.merge(min_price, max_price, on = 'author_name', how ='outer')
authors_stat_1

             price_x  price_y
author_name
Островский       290      370
Тургенев         300      450
Чехов            450      500

In [166]:
authors_stat = pd.merge(authors_stat_1, mean_price, on = 'author_name', how ='outer' ) 
authors_stat

             price_x  price_y       price
author_name
Островский       290      370  330.000000
Тургенев         300      450  366.666667
Чехов            450      500  475.000000

In [167]:
authors_stat = authors_stat.rename(columns={"price_x": "min_price", "price_y": "max_price", "price": "mean_price"})
authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

TASK 5

In [168]:
authors_price['cover'] = 'твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'

In [169]:
 authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [170]:
book_info = pd.pivot_table(authors_price, values=['price'], index=['author_name'],
                     columns=['cover'], aggfunc=np.sum, fill_value=0)

In [171]:
book_info

             price
cover       мягкая твердая
author_name
Островский     660       0
Тургенев       650     450
Чехов            0     950

In [172]:
book_info.to_pickle("book_info.pkl")

In [175]:
book_info_2 = pd.read_pickle("book_info.pkl")
print(book_info_2)

             price
cover       мягкая твердая
author_name
Островский     660       0
Тургенев       650     450
Чехов            0     950